БухЭксп/Enums/CW_ВидыОперацийДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперацийДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщикуПоПриобретениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперацийДДС/Ext/ManagerModule.bsl
Функция ПолучитьСписокВидовОпераций() Экспорт
	
	ВсеВидыОпераций = Перечисления.CW_ВидыОперацийДДС;
	
	СписокДоступныхЗначений = Новый СписокЗначений;
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ПоступлениеОтПокупателя);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ВозвратПокупателю);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ОплатаПоставщику);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ВозвратОтПоставщика);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ОплатаПоставщикуПоПриобретениям);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ПеремещениеВДругуюКассу);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ПрочиеПоступления);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ПрочиеСписания);
	
	Возврат СписокДоступныхЗначений;
	
КонецФункции
